[
  {
    "name": "Mr. Hamdy Rashad",
    "title": "Chairman",
    "signature": "",
    "imageWebp": "Hamdy-Rashad.webp",
    "imageJpg": "Hamdy-Rashad.jpg",
    "bio": "Hamdy Rashad is a world-class financial expert and a battle-hardened businessman, with more than 50 years of experience in government and international corporate management. Rashad was a member of the Egyptian presidential advisory body, the National Council for Production and Economic Affairs; and the board of the state-owned Holding Company for Trade and Cotton; Egyptian Financial Supervisory Authority (EFSA) from 2013 to 2017; and 13 other private and public sector companies including Egyptian Sun for Agricultural Development and Alpha Capital for Financial Consulting. He also served the second-in-command of the public enterprises ministry from 2002 to 2003, and was a member of several official committees like the Financial & Economic Policies Committee and the Investment Committee at the Egyptian Businessmen Association. Rashad is also a founding member and former CEO of the very successful Rashad Holding for Financial Investments; ElRashad Asset Management and ElRashad Securities Brokerage. He used to lecture at the Central Bank of Egypt, the American University in Cairo and Egyptian Capital Market Association; and was the former CEO and Vice President of Flemings-Mansour Securities Brokerage. Throughout his career, Rashad managed business worth well over $600 million USD in GTE systems, among other things, in the US, Egypt and elsewhere. "
  },
  {
    "name": "Mr. Mohab Zakaria",
    "title": "Chief Executive Officer",
    "signature": "",
    "imageWebp": "Mohab-Zakaria.webp",
    "imageJpg": "Mohab-Zakaria.jpg",
    "bio": ""
  },
  {
    "name": "Mr. Adnan Al Salem",
    "title": "Board Member",
    "signature": "",
    "imageWebp": "Adnan-Al-Salem.webp",
    "imageJpg": "Adnan-Al-Salem.jpg",
    "bio": "Adnan Salman Al-Salem is the CEO of Al-Raya Al Mutamayeza Holding, and is the top representative in all its official and legal dealings. Al-Salem used to be Executive VP of Investments, Head of Banking Group at the state-owned Warba Bank, and Regional Head of branches at Kuwait Finance House (KFH), Kuwait’s largest Islamic Bank. Al-Salem’s experience honed his leadership skills, and prepared him over the years for the mammoth task of leading Al-Raya, developing its policies and strategies; supervising their implementation; assessing risk, and evaluating performance. He is renowned for his negotiation skills in the Arabian gulf, and he was responsible for establishment of KFH branches in Bahrain & Malaysia. During his time with Warba Bank, he also upgraded the country’s ATM’s systems, through membership in KNET’s board of directors."
  },
  {
    "name": "Mr. Jassim Al Faji",
    "title": "Board Member",
    "signature": "",
    "imageWebp": "Jassim-Al-Faji.webp",
    "imageJpg": "Jassim-Al-Faji.jpg",
    "bio": "Jassim Mohamed H. Al Fajji is the CEO and vice-chairman of Al Raya Holding Co., the mothership of a variety of investments in hotels, real estate, insurance, and oil and gas companies. Faji entered the world of business in 1994 when he opened his company, which was mostly focused on the religious tourism sector, particularly Hajj and Umrah services, hotel management and education. He is also the director and co-founder of Jaddara, which is a hotel development, management and consultancy firm that is wildly successful in Kuwait. Faji is also the founder of four other famous companies in the gulf, which import food and beverages; and provide contracting services, electricity, and insurance. His main focus, Al Raya Holding, has branches in Egypt, Saudi Arabia, Turkey and Hungary, and it is worth over $150 million USD. Faji is currently overseeing an ambitious campaign to Al Raya’s operations further in Egypt, the Middle East, Africa and elsewhere. "
  },
  {
    "name": "Mr. Moustafa Kamal",
    "title": "Board Member",
    "signature": "",
    "imageWebp": "Mostafa-Kamal.webp",
    "imageJpg": "Mostafa-Kamal.jpg",
    "bio": "Mostafa Kamal Mohamed Hosni is an accounting and finance expert with a professional career spanning 40+ years. His career began at Banque Du Caire in Egypt as an accountant. He then moved to the Kingdom of Saudi Arabia, where he served as the Head of Budget Control at Al Riyadh Bank from 1978 till 1990, where he was responsible for all annual financial reports for the bank as a whole. Returning to Egypt, Kamal was quickly scooped up by the Egyptian co. Al-Masreyeen for Food Production, where he served as their Chief Finance Officer up to 2000, and then moved on to become the group’s Deputy CEO up to 2008. In 2009, Kamal joined Matrex, where his expertise in financial analysis, planning and management quickly earned him the role of General Manager for Finance & Administrative affairs. He remained with Matrex and the MCIG until their most recent JV with the Faji’s in December 2018, when he took up the position of Head of Document Control for the newly established group of businesses."
  },
  {
    "name": "Mr. Attia Salem",
    "title": "Board Member",
    "signature": "",
    "imageWebp": "Attia-Salem.webp",
    "imageJpg": "Attia-Salem.jpg",
    "bio": ""
  },
  {
    "name": "Mr. Ahmed Darwish",
    "title": "Board Member",
    "signature": "",
    "imageWebp": "Ahmed-Darwish.webp",
    "imageJpg": "Ahmed-Darwish.jpg",
    "bio": "Ahmed Mahmoud Othman Darwish is a prominent university professor at Cairo University’s School of Engineering, where he earned both his Bachelors in Telecommunications and his Masters in Computer Engineering. He has a PhD from California Davis University and is one of Egypt’s most successful telecommunication engineers. Professionally, Darwish served as the Minister of Administrative Development from 2004 to 2011, and was also the Head of the Suez Canal Economic Zone Authority. Darwish has also served as a consultant for the UNDP, UNESCO, World Bank, FAO, European Commission, UNIDO and UNESCWA, along with many other international firms in Africa, the US, Egypt and the Middle East. Darwish, 60, has won Egypt several awards. Under him, Egypt’s electronic government services jumped from a world ranking of 192 to 23 in 2010. He also computerised Egypt’s food subsidy distribution system, introducing smart subsidy ID cards to combat mismanagement and corruption. In 2007, the government of Singapore named him as one of the most influential figures in the Middle East. "
  },
  {
    "name": "Mr. Mohamed Gad",
    "title": "Board Member",
    "signature": "",
    "imageWebp": "Mohamed-Gad.webp",
    "imageJpg": "Mohamed-Gad.jpg",
    "bio": ""
  },
  {
    "name": "Mrs. Azza Saleh",
    "title": "Board Member",
    "signature": "",
    "imageWebp": "Azza-Saleh.webp",
    "imageJpg": "Azza-Saleh.jpg",
    "bio": ""
  }
]
