[
  {
    "name": "Mr. Hamdy Rashad",
    "title": "Chairman",
    "signature": "",
    "imageWebp": "Hamdy-Rashad.webp",
    "imageJpg": "Hamdy-Rashad.jpg",
    "bio": "Hamdy Rashad is a world-class financial expert and a battle-hardened businessman, with more than 50 years of experience in government and international corporate management. Rashad was a member of the Egyptian presidential advisory body, the National Council for Production and Economic Affairs; and the board of the state-owned Holding Company for Trade and Cotton; Egyptian Financial Supervisory Authority (EFSA) from 2013 to 2017; and 13 other private and public sector companies including Egyptian Sun for Agricultural Development and Alpha Capital for Financial Consulting. He also served the second-in-command of the public enterprises ministry from 2002 to 2003, and was a member of several official committees like the Financial & Economic Policies Committee and the Investment Committee at the Egyptian Businessmen Association. Rashad is also a founding member and former CEO of the very successful Rashad Holding for Financial Investments; ElRashad Asset Management and ElRashad Securities Brokerage. He used to lecture at the Central Bank of Egypt, the American University in Cairo and Egyptian Capital Market Association; and was the former CEO and Vice President of Flemings-Mansour Securities Brokerage. Throughout his career, Rashad managed business worth well over $600 million USD in GTE systems, among other things, in the US, Egypt and elsewhere. "
  },
  {
    "name": "Mr. Mohab Zakaria",
    "title": "Chief Executive Officer",
    "signature": "",
    "imageWebp": "Mohab-Zakaria.webp",
    "imageJpg": "Mohab-Zakaria.jpg",
    "bio": "Mohab Abdelmeguid Zakaria is a graduate of the prestigious Faculty of Economics and Political Science, Cairo University. He is originally from the world of corporate banking where he started his 9 year career at CIB Egypt and worked across all departments, and it was where he earned his credit course certification to become a credit officer. He was in charge of the government lending program and worked closely with SMEs and mega-corporates. He led the IPO of Chipsy for Food and PepsiCo, which was among the biggest in Egypt, and was one of the key people who founded the retail banking arm of CIB, before moving on to start his own business, a shareholding company called Matrex in 2003. Under his leadership, Matrex grew from a single entity into a group of businesses, to be a key player in the contracting, trade, mining, specialized engineering and aviation sectors of Africa and the Middle East, executing large-scale projects for USAID and the official aid agencies of Denmark and Finland, among other things. In 2018, Zakaria began to restructure and transform Matrex into a financial holding company, and joined forces with Kuwait’s Al Raya United group, to create MEDAF Investments, which aims to develop the financial services & other business sectors in Africa and the Middle East."
  },
  {
    "name": "Mr. Adnan Al Salem",
    "title": "Board Member",
    "signature": "",
    "imageWebp": "Adnan-Al-Salem.webp",
    "imageJpg": "Adnan-Al-Salem.jpg",
    "bio": "Adnan Salman Al-Salem is the CEO of Al-Raya Al Mutamayeza Holding, and is the top representative in all its official and legal dealings. Al-Salem used to be Executive VP of Investments, Head of Banking Group at the state-owned Warba Bank, and Regional Head of branches at Kuwait Finance House (KFH), Kuwait’s largest Islamic Bank. Al-Salem’s experience honed his leadership skills, and prepared him over the years for the mammoth task of leading Al-Raya, developing its policies and strategies; supervising their implementation; assessing risk, and evaluating performance. He is renowned for his negotiation skills in the Arabian gulf, and he was responsible for establishment of KFH branches in Bahrain & Malaysia. During his time with Warba Bank, he also upgraded the country’s ATM’s systems, through membership in KNET’s board of directors."
  },
  {
    "name": "Mr. Jassim Al Faji",
    "title": "Board Member",
    "signature": "",
    "imageWebp": "Jassim-Al-Faji.webp",
    "imageJpg": "Jassim-Al-Faji.jpg",
    "bio": "Jassim Mohamed H. Al Fajji is the CEO and vice-chairman of Al Raya Holding Co., the mothership of a variety of investments in hotels, real estate, insurance, and oil and gas companies. Faji entered the world of business in 1994 when he opened his company, which was mostly focused on the religious tourism sector, particularly Hajj and Umrah services, hotel management and education. He is also the director and co-founder of Jaddara, which is a hotel development, management and consultancy firm that is wildly successful in Kuwait. Faji is also the founder of four other famous companies in the gulf, which import food and beverages; and provide contracting services, electricity, and insurance. His main focus, Al Raya Holding, has branches in Egypt, Saudi Arabia, Turkey and Hungary, and it is worth over $150 million USD. Faji is currently overseeing an ambitious campaign to Al Raya’s operations further in Egypt, the Middle East, Africa and elsewhere. "
  },
  {
    "name": "Mr. Moustafa Kamal",
    "title": "Board Member",
    "signature": "",
    "imageWebp": "Mostafa-Kamal.webp",
    "imageJpg": "Mostafa-Kamal.jpg",
    "bio": "Mostafa Kamal Mohamed Hosni is an accounting and finance expert with a professional career spanning 40+ years. His career began at Banque Du Caire in Egypt as an accountant. He then moved to the Kingdom of Saudi Arabia, where he served as the Head of Budget Control at Al Riyadh Bank from 1978 till 1990, where he was responsible for all annual financial reports for the bank as a whole. Returning to Egypt, Kamal was quickly scooped up by the Egyptian co. Al-Masreyeen for Food Production, where he served as their Chief Finance Officer up to 2000, and then moved on to become the group’s Deputy CEO up to 2008. In 2009, Kamal joined Matrex, where his expertise in financial analysis, planning and management quickly earned him the role of General Manager for Finance & Administrative affairs. He remained with Matrex and the MCIG until their most recent JV with the Faji’s in December 2018, when he took up the position of Head of Document Control for the newly established group of businesses."
  },
  {
    "name": "Mr. Attia Salem",
    "title": "Board Member",
    "signature": "",
    "imageWebp": "Attia-Salem.webp",
    "imageJpg": "Attia-Salem.jpg",
    "bio": ""
  },
  {
    "name": "Mr. Ahmed Darwish",
    "title": "Board Member",
    "signature": "",
    "imageWebp": "Ahmed-Darwish.webp",
    "imageJpg": "Ahmed-Darwish.jpg",
    "bio": "Ahmed Mahmoud Othman Darwish is a prominent university professor at Cairo University’s School of Engineering, where he earned both his Bachelors in Telecommunications and his Masters in Computer Engineering. He has a PhD from California Davis University and is one of Egypt’s most successful telecommunication engineers. Professionally, Darwish served as the Minister of Administrative Development from 2004 to 2011, and was also the Head of the Suez Canal Economic Zone Authority. Darwish has also served as a consultant for the UNDP, UNESCO, World Bank, FAO, European Commission, UNIDO and UNESCWA, along with many other international firms in Africa, the US, Egypt and the Middle East. Darwish, 60, has won Egypt several awards. Under him, Egypt’s electronic government services jumped from a world ranking of 192 to 23 in 2010. He also computerised Egypt’s food subsidy distribution system, introducing smart subsidy ID cards to combat mismanagement and corruption. In 2007, the government of Singapore named him as one of the most influential figures in the Middle East. "
  },
  {
    "name": "Mr. Mohamed Gad",
    "title": "Board Member",
    "signature": "",
    "imageWebp": "Mohamed-Gad.webp",
    "imageJpg": "Mohamed-Gad.jpg",
    "bio": "Mohamed Mostafa Gad is one of Egypt’s most revered financial experts. He served as the vice chairman of the country’s investment authority from 2007 to 2009 and as a senior advisor to the planning minister in 2017. He has since become an independent advisor to various esteemed companies and associations. Gad has extensive management experience that dates back to 1980 when he became the Assistant Manager for Investment, Capital Markets and Treasury at the Egyptian American Bank (EAB). He moved on to chair CAPEX Corp. for Asset Management in 1998 and then Free Zone Media City in 2007. His career spans over 35+ years, and he is a founder of the Egyptian Dealers Association, a highly influential organization, as well as the Egyptian Association for Governance and Board of Directors in Egypt. He is the former Secretary General of the Arab Cambridge Association. "
  },
  {
    "name": "Mrs. Azza Saleh",
    "title": "Board Member",
    "signature": "",
    "imageWebp": "Azza-Saleh.webp",
    "imageJpg": "Azza-Saleh.jpg",
    "bio": "Azza Saleh is Egypt’s first CFA certified legal accountant and financial analyst, who was the chair of Solutions For Financial Consultancy, a firm that offered consultancies as well as performance assessments, feasibility studies, internal auditing and restructuring services. Saleh headed the preliminary restructuring of Egypt’s vast and vital water and sewage treatment company, which was funded by USAID in 2012. She also sits on the board of other companies including Richardson Investment and PICO Investment; and served as a consultant to the transport minister in 2006-2007. Saleh played an instrumental role in founding the operations of McDonald’s and General Motors to Egypt, and establishing Mantrac, Caterpillar’s agent in Egypt. She also served as the head of their financial departments. As an executive manager at Fleming Insurance Company, she oversaw the IPO of Orascom, Savola, and Chipsy in 1997-1999. "
  }
]
